{
"data1" : "Near the ancient Indian kingdom of Mahishmati, an injured woman is seen exiting a cave down by a mountain waterfall carrying an infant. She kills two soldiers pursuing and attempts to cross a raging river, but slips and is washed away in the current. Before drowning, she holds the baby aloft with her hand and prays to Lord Shiva, demanding that the baby - Mahendra Baahubali, must live. The baby is saved by the people of the local Amburi tribe, who reside near the river and worship Lord Shiva. Despite the villagers' pleas to take the baby back up the mountain to where he came from, the wife of the tribe's chieftain, Sanga, decides to adopt him, in order to protect him from harm's way. She names the baby as Shivudu (Shivu). Shivu grows up to be an ambitious and mischievous child, obsessed with the goal of ascending the mountain, curious to explore what is the top. Despite Sanga's continuous pleas, he constantly tries and fails repeatedly, albeit improving at each attempt. At the young age of 25, he is shown to possess superhuman strength when he lifts a Lingam of Shiva and placing it at the foot of the mountain. He later finds a mask that has apparently fallen from the top of the mountain. Realizing it may possess feminine features, he is motivated to scale the mountain and succeeds, albeit with difficulty. At the top, he witnesses a woman named Avantika slaying Mahishmati soldiers. He discovers that she is a warrior from a local resistance tribe, dedicated with the aim of overthrowing the tyrannical king of Mahishmati, Lord Bhallaladeva (Bhalvalathevan) and rescuing an important captive - Princess Devasena, who happens to be the sister of the resistance's chief, Jaya Varma. Shivu is instantly smitten with Avantika and secretly follows her, even managing to draw a tattoo on her hand (while she is sleeping). Avantika is later tasked with rescuing Devasena. She discovers about Shivu and attacks him, but Shivu overpowers her and returns her mask to her. Realizing that he had scaled the mountain just for her, she reciprocates his feelings. The pair are later attacked by more soldiers from Mahishmati. Overpowering them, Shivu pledges to rescue Devasena and departs. He secretly enters Mahishmati on Bhalladeva's birthday and discreetly assists in erecting a gigantic statue of Bhalla. In the process, he is apparently identified by a worker, who along with the other workers, chant the name 'Baahubali', much to Shivu's confusion and Bhalla's embarrassment. Shivu later infiltrates the royal palace disguised as a soldier and causes a commotion, allowing Bhalla and his guards to be distracted long enough for him to rescue Devasena. Bhalla dispatches Bhadra, his adoptive son and Kattappa, his loyal slave to recapture Devasena. They manage to do so, but Shivu manages to overpower them and beheads Bhadra, exactly at the moment when Sanga, the Amburis, Avantika and her compatriots arrive. Infuriated, Kattappa lunges at Shivu, but stops short of attacking him upon catching a glimpse of his face. He falls into submission at Shivu's feet, proclaiming him as 'Baahubali'. The next morning, a now friendly Kattappa explains to Shivu about his true origins. Shivu is actually Mahendra Baahubali, the son of a famous warrior prince of Mahishmati - Amarendra Baahubali. Kattapa then narrates the past - Amarendra was born as an orphan; his father, King Vikramadeva had died before he was born and his mother had died giving birth to him. Lord Bijjaladeva, Vikramadeva's brother and the next-in-line in the Mahishmati royal family, was denied the throne, due to his cunning and deranged nature. Bijjaladeva's wife, Lord Sivagami, assumed power as an acting monarch, with the intention of raising both Bhalla (who happenned to be her son) and Amarendra, in an equal manner, in order to appropriately select the next heir to the throne of Mahishmati. Bhalla and Amarendra are both raised equally and trained rigorously in the arts of warfare, mathematics, administration, logic and numerous other subjects. Bijjaladeva, keen on making his son the next king, encourages Bhalla to do what ever it takes to ascend the throne; as a result Bhalla treats his subjects with cruelty and unmindfulness. Amarendra, on the other hand, grows up to be more mature and gains popularity in the kingdom. A traitor in the kingdom named Sakithan turns out to be a spy for the malicious Kalakeya tribe, who are known to be savages and destroyers of kingdoms. Their chief Inkoshi declares war due to past conflict with Mahishmati, and the royals respond strategically. Sivagami decides that whoever kills Inkoshi would be the new worthy king, so they assign the princes troops. Bijjaladeva secretly makes sure Bhalla has more weapons and men. Baahubali manages to destroy more Kalakeya troops in the coming battle as well as motivating his soldiers and saving hostage subjects. He subdues Inkoshi and Bhalla kills him, but for his valour and concern for the people of his kingdom, Sivagami wishes to crown him king. In the present day, Shivu's parents wish to meet Amarendra, being impressed upon hearing his story. A dejected Kattappa reveals that Amarendra is dead. Upon being questioned by Shivu of his father's death, Kattappa further reveals that Amarendra was murdered, by none other than himself, before the screen cuts to black.",
"data2" : "The film was conceived by Rajamouli's father K.V.Vijayendra Prasad, who randomly told him a story about Sivagami, a woman who carries a baby in her hand while crossing a river, and a few years later about Kattappa, which intrigued Rajamouli. His fascination with mythology and the tales of the Amar Chitra Katha comics further fuelled his interest in the story. However, it took the writers three months to complete the final draft. The soundtrack and background score were composed by M.M.Keeravani while the cinematography, production design, and VFX were handled by K.K.Senthil Kumar, Sabu Cyril and V.Srinivas Mohan respectively."
}